app/controllers/items_controller.rb

  def index
    # @user = User.find(params[:user_id])
    # @items = Item.where(user_id: @user.id)
    # render json: @items, include: :user, status: :ok
    @items = Item.order(:id)
---
SELECT "items".* FROM "items" ORDER BY "items"."id" ASC

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("name", "description", "img_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdasd"], ["description", "asdasdas"], ["img_link", ""], ["created_at", "2020-04-13 18:39:37.292595"], ["updated_at", "2020-04-13 18:39:37.292595"]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["name", "Antibacterial Cleaner"], ["description", "As the label says, \"Stay at home, SAVE LIVES.\""], ["updated_at", "2020-04-15 01:35:11.683614"], ["id", 13]]

    def set_item
      puts params[:id]
      @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]